/* automatically generated by rust-bindgen 0.71.1 */

use libc::FILE;

pub const BITWUZLA_SAT: BitwuzlaResult = 10;
pub const BITWUZLA_UNSAT: BitwuzlaResult = 20;
pub const BITWUZLA_UNKNOWN: BitwuzlaResult = 0;
pub type BitwuzlaResult = ::std::os::raw::c_uint;
pub const BITWUZLA_RM_RNE: BitwuzlaRoundingMode = 0;
pub const BITWUZLA_RM_RNA: BitwuzlaRoundingMode = 1;
pub const BITWUZLA_RM_RTN: BitwuzlaRoundingMode = 2;
pub const BITWUZLA_RM_RTP: BitwuzlaRoundingMode = 3;
pub const BITWUZLA_RM_RTZ: BitwuzlaRoundingMode = 4;
pub const BITWUZLA_RM_MAX: BitwuzlaRoundingMode = 5;
pub type BitwuzlaRoundingMode = ::std::os::raw::c_uint;
pub const BITWUZLA_KIND_CONSTANT: BitwuzlaKind = 0;
pub const BITWUZLA_KIND_CONST_ARRAY: BitwuzlaKind = 1;
pub const BITWUZLA_KIND_VALUE: BitwuzlaKind = 2;
pub const BITWUZLA_KIND_VARIABLE: BitwuzlaKind = 3;
pub const BITWUZLA_KIND_AND: BitwuzlaKind = 4;
pub const BITWUZLA_KIND_DISTINCT: BitwuzlaKind = 5;
pub const BITWUZLA_KIND_EQUAL: BitwuzlaKind = 6;
pub const BITWUZLA_KIND_IFF: BitwuzlaKind = 7;
pub const BITWUZLA_KIND_IMPLIES: BitwuzlaKind = 8;
pub const BITWUZLA_KIND_NOT: BitwuzlaKind = 9;
pub const BITWUZLA_KIND_OR: BitwuzlaKind = 10;
pub const BITWUZLA_KIND_XOR: BitwuzlaKind = 11;
pub const BITWUZLA_KIND_ITE: BitwuzlaKind = 12;
pub const BITWUZLA_KIND_EXISTS: BitwuzlaKind = 13;
pub const BITWUZLA_KIND_FORALL: BitwuzlaKind = 14;
pub const BITWUZLA_KIND_APPLY: BitwuzlaKind = 15;
pub const BITWUZLA_KIND_LAMBDA: BitwuzlaKind = 16;

pub const BITWUZLA_OPT_PROP_NORMALIZE: BitwuzlaOption = 22;
pub const BITWUZLA_OPT_ABSTRACTION: BitwuzlaOption = 23;
pub const BITWUZLA_OPT_ABSTRACTION_BV_SIZE: BitwuzlaOption = 24;
pub const BITWUZLA_OPT_ABSTRACTION_EAGER_REFINE: BitwuzlaOption = 25;
pub const BITWUZLA_OPT_ABSTRACTION_VALUE_LIMIT: BitwuzlaOption = 26;
pub const BITWUZLA_OPT_ABSTRACTION_VALUE_ONLY: BitwuzlaOption = 27;
pub const BITWUZLA_OPT_ABSTRACTION_ASSERT: BitwuzlaOption = 28;
pub const BITWUZLA_OPT_ABSTRACTION_ASSERT_REFS: BitwuzlaOption = 29;
pub const BITWUZLA_OPT_ABSTRACTION_INITIAL_LEMMAS: BitwuzlaOption = 30;
pub const BITWUZLA_OPT_ABSTRACTION_INC_BITBLAST: BitwuzlaOption = 31;
pub const BITWUZLA_OPT_ABSTRACTION_BV_ADD: BitwuzlaOption = 32;
pub const BITWUZLA_OPT_ABSTRACTION_BV_MUL: BitwuzlaOption = 33;
pub const BITWUZLA_OPT_ABSTRACTION_BV_UDIV: BitwuzlaOption = 34;
pub const BITWUZLA_OPT_ABSTRACTION_BV_UREM: BitwuzlaOption = 35;
pub const BITWUZLA_OPT_ABSTRACTION_EQUAL: BitwuzlaOption = 36;
pub const BITWUZLA_OPT_ABSTRACTION_ITE: BitwuzlaOption = 37;
pub const BITWUZLA_OPT_PREPROCESS: BitwuzlaOption = 38;
pub const BITWUZLA_OPT_PP_CONTRADICTING_ANDS: BitwuzlaOption = 39;
pub const BITWUZLA_OPT_PP_ELIM_BV_EXTRACTS: BitwuzlaOption = 40;
pub const BITWUZLA_OPT_PP_ELIM_BV_UDIV: BitwuzlaOption = 41;
pub const BITWUZLA_OPT_PP_EMBEDDED_CONSTR: BitwuzlaOption = 42;
pub const BITWUZLA_OPT_PP_FLATTEN_AND: BitwuzlaOption = 43;
pub const BITWUZLA_OPT_PP_NORMALIZE: BitwuzlaOption = 44;
pub const BITWUZLA_OPT_PP_SKELETON_PREPROC: BitwuzlaOption = 45;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST: BitwuzlaOption = 46;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_EQ: BitwuzlaOption = 47;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_DISEQ: BitwuzlaOption = 48;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_BV_INEQ: BitwuzlaOption = 49;
pub const BITWUZLA_OPT_DBG_RW_NODE_THRESH: BitwuzlaOption = 50;
pub const BITWUZLA_OPT_DBG_PP_NODE_THRESH: BitwuzlaOption = 51;
pub const BITWUZLA_OPT_DBG_CHECK_MODEL: BitwuzlaOption = 52;
pub const BITWUZLA_OPT_DBG_CHECK_UNSAT_CORE: BitwuzlaOption = 53;
pub const BITWUZLA_OPT_NUM_OPTS: BitwuzlaOption = 54;
pub type BitwuzlaOption = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn bitwuzla_copyright() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bitwuzla_version() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bitwuzla_git_id() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo {
    pub opt: BitwuzlaOption,
    pub shrt: *const ::std::os::raw::c_char,
    pub lng: *const ::std::os::raw::c_char,
    pub description: *const ::std::os::raw::c_char,
    pub is_numeric: bool,
    pub numeric: BitwuzlaOptionInfo_NumericValue,
    pub mode: BitwuzlaOptionInfo_ModeValue,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo_NumericValue {
    pub cur: u64,
    pub dflt: u64,
    pub min: u64,
    pub max: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BitwuzlaOptionInfo_NumericValue"]
        [::std::mem::size_of::<BitwuzlaOptionInfo_NumericValue>() - 32usize];
    ["Alignment of BitwuzlaOptionInfo_NumericValue"]
        [::std::mem::align_of::<BitwuzlaOptionInfo_NumericValue>() - 8usize];
    ["Offset of field: BitwuzlaOptionInfo_NumericValue::cur"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_NumericValue, cur) - 0usize];
    ["Offset of field: BitwuzlaOptionInfo_NumericValue::dflt"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_NumericValue, dflt) - 8usize];
    ["Offset of field: BitwuzlaOptionInfo_NumericValue::min"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_NumericValue, min) - 16usize];
    ["Offset of field: BitwuzlaOptionInfo_NumericValue::max"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_NumericValue, max) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo_ModeValue {
    pub cur: *const ::std::os::raw::c_char,
    pub dflt: *const ::std::os::raw::c_char,
    pub num_modes: usize,
    pub modes: *mut *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BitwuzlaOptionInfo_ModeValue"]
        [::std::mem::size_of::<BitwuzlaOptionInfo_ModeValue>() - 32usize];
    ["Alignment of BitwuzlaOptionInfo_ModeValue"]
        [::std::mem::align_of::<BitwuzlaOptionInfo_ModeValue>() - 8usize];
    ["Offset of field: BitwuzlaOptionInfo_ModeValue::cur"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_ModeValue, cur) - 0usize];
    ["Offset of field: BitwuzlaOptionInfo_ModeValue::dflt"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_ModeValue, dflt) - 8usize];
    ["Offset of field: BitwuzlaOptionInfo_ModeValue::num_modes"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_ModeValue, num_modes) - 16usize];
    ["Offset of field: BitwuzlaOptionInfo_ModeValue::modes"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo_ModeValue, modes) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BitwuzlaOptionInfo"][::std::mem::size_of::<BitwuzlaOptionInfo>() - 104usize];
    ["Alignment of BitwuzlaOptionInfo"][::std::mem::align_of::<BitwuzlaOptionInfo>() - 8usize];
    ["Offset of field: BitwuzlaOptionInfo::opt"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, opt) - 0usize];
    ["Offset of field: BitwuzlaOptionInfo::shrt"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, shrt) - 8usize];
    ["Offset of field: BitwuzlaOptionInfo::lng"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, lng) - 16usize];
    ["Offset of field: BitwuzlaOptionInfo::description"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, description) - 24usize];
    ["Offset of field: BitwuzlaOptionInfo::is_numeric"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, is_numeric) - 32usize];
    ["Offset of field: BitwuzlaOptionInfo::numeric"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, numeric) - 40usize];
    ["Offset of field: BitwuzlaOptionInfo::mode"]
        [::std::mem::offset_of!(BitwuzlaOptionInfo, mode) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptions {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn bitwuzla_options_new() -> *mut BitwuzlaOptions;
}
unsafe extern "C" {
    pub fn bitwuzla_options_delete(options: *mut BitwuzlaOptions);
}
unsafe extern "C" {
    pub fn bitwuzla_option_is_valid(
        options: *mut BitwuzlaOptions,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn bitwuzla_option_is_numeric(
        options: *mut BitwuzlaOptions,
        option: BitwuzlaOption,
    ) -> bool;
}
unsafe extern "C" {
    pub fn bitwuzla_option_is_mode(options: *mut BitwuzlaOptions, option: BitwuzlaOption) -> bool;
}
unsafe extern "C" {
    pub fn bitwuzla_set_option(options: *mut BitwuzlaOptions, option: BitwuzlaOption, val: u64);
}
unsafe extern "C" {
    pub fn bitwuzla_set_option_mode(
