/* automatically generated by rust-bindgen 0.59.1 */

use libc::{FILE, size_t};

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const BitwuzlaBVBase_BITWUZLA_BV_BASE_BIN: BitwuzlaBVBase = 0;
pub const BitwuzlaBVBase_BITWUZLA_BV_BASE_DEC: BitwuzlaBVBase = 1;

pub const BitwuzlaOption_BITWUZLA_OPT_PROP_SEXT: BitwuzlaOption = 83;
pub const BitwuzlaOption_BITWUZLA_OPT_PROP_SKIP_NO_PROGRESS: BitwuzlaOption = 84;
pub const BitwuzlaOption_BITWUZLA_OPT_PROP_XOR: BitwuzlaOption = 85;
pub const BitwuzlaOption_BITWUZLA_OPT_AIGPROP_NPROPS: BitwuzlaOption = 86;
pub const BitwuzlaOption_BITWUZLA_OPT_AIGPROP_USE_BANDIT: BitwuzlaOption = 87;
pub const BitwuzlaOption_BITWUZLA_OPT_AIGPROP_USE_RESTARTS: BitwuzlaOption = 88;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_CER: BitwuzlaOption = 89;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_DER: BitwuzlaOption = 90;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_DUAL_SOLVER: BitwuzlaOption = 91;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_MINISCOPE: BitwuzlaOption = 92;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_SYNTH: BitwuzlaOption = 93;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_FIXSYNTH: BitwuzlaOption = 94;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_SYNTH_ITE_COMPLETE: BitwuzlaOption = 95;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_SYNTH_LIMIT: BitwuzlaOption = 96;
pub const BitwuzlaOption_BITWUZLA_OPT_QUANT_SYNTH_QI: BitwuzlaOption = 97;
pub const BitwuzlaOption_BITWUZLA_OPT_CHECK_MODEL: BitwuzlaOption = 98;
pub const BitwuzlaOption_BITWUZLA_OPT_CHECK_UNCONSTRAINED: BitwuzlaOption = 99;
pub const BitwuzlaOption_BITWUZLA_OPT_CHECK_UNSAT_ASSUMPTIONS: BitwuzlaOption = 100;
pub const BitwuzlaOption_BITWUZLA_OPT_DECLSORT_BV_WIDTH: BitwuzlaOption = 101;
pub const BitwuzlaOption_BITWUZLA_OPT_LS_SHARE_SAT: BitwuzlaOption = 102;
pub const BitwuzlaOption_BITWUZLA_OPT_PARSE_INTERACTIVE: BitwuzlaOption = 103;
pub const BitwuzlaOption_BITWUZLA_OPT_SAT_ENGINE_CADICAL_FREEZE: BitwuzlaOption = 104;
pub const BitwuzlaOption_BITWUZLA_OPT_SAT_ENGINE_LGL_FORK: BitwuzlaOption = 105;
pub const BitwuzlaOption_BITWUZLA_OPT_SAT_ENGINE_N_THREADS: BitwuzlaOption = 106;
pub const BitwuzlaOption_BITWUZLA_OPT_SMT_COMP_MODE: BitwuzlaOption = 107;
pub const BitwuzlaOption_BITWUZLA_OPT_NUM_OPTS: BitwuzlaOption = 108;
pub type BitwuzlaOption = ::std::os::raw::c_uint;
#[repr(C)]
pub struct BitwuzlaOptionInfo {
    pub opt: BitwuzlaOption,
    pub shrt: *const ::std::os::raw::c_char,
    pub lng: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub is_numeric: bool,
    pub __bindgen_anon_1: BitwuzlaOptionInfo__bindgen_ty_1,
}
#[repr(C)]
pub struct BitwuzlaOptionInfo__bindgen_ty_1 {
    pub numeric: __BindgenUnionField<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>,
    pub string: __BindgenUnionField<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>,
    pub bindgen_union_field: [u64; 4usize],
}
#[repr(C)]
pub struct BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1 {
    pub cur_val: u32,
    pub def_val: u32,
    pub min_val: u32,
    pub max_val: u32,
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>())).cur_val
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cur_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>())).def_val
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(def_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>())).min_val
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(min_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1>())).max_val
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_val)
        )
    );
}
#[repr(C)]
pub struct BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2 {
    pub cur_val: *const ::std::os::raw::c_char,
    pub def_val: *const ::std::os::raw::c_char,
    pub num_values: size_t,
    pub values: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>())).cur_val
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(cur_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>())).def_val
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(def_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>())).num_values
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(num_values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2>())).values
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(values)
        )
    );
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1>())).numeric as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1),
            "::",
            stringify!(numeric)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BitwuzlaOptionInfo__bindgen_ty_1>())).string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo__bindgen_ty_1),
            "::",
            stringify!(string)
        )
    );
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo() {
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo>(),
        72usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BitwuzlaOptionInfo>())).opt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BitwuzlaOptionInfo>())).shrt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(shrt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BitwuzlaOptionInfo>())).lng as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(lng)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BitwuzlaOptionInfo>())).desc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BitwuzlaOptionInfo>())).is_numeric as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(is_numeric)
        )
    );
}
pub const BitwuzlaKind_BITWUZLA_KIND_CONST: BitwuzlaKind = 0;
pub const BitwuzlaKind_BITWUZLA_KIND_CONST_ARRAY: BitwuzlaKind = 1;
pub const BitwuzlaKind_BITWUZLA_KIND_VAL: BitwuzlaKind = 2;
pub const BitwuzlaKind_BITWUZLA_KIND_VAR: BitwuzlaKind = 3;
pub const BitwuzlaKind_BITWUZLA_KIND_AND: BitwuzlaKind = 4;
pub const BitwuzlaKind_BITWUZLA_KIND_APPLY: BitwuzlaKind = 5;
pub const BitwuzlaKind_BITWUZLA_KIND_ARRAY_SELECT: BitwuzlaKind = 6;
pub const BitwuzlaKind_BITWUZLA_KIND_ARRAY_STORE: BitwuzlaKind = 7;
pub const BitwuzlaKind_BITWUZLA_KIND_BV_ADD: BitwuzlaKind = 8;
pub const BitwuzlaKind_BITWUZLA_KIND_BV_AND: BitwuzlaKind = 9;
pub const BitwuzlaKind_BITWUZLA_KIND_BV_ASHR: BitwuzlaKind = 10;
pub const BitwuzlaKind_BITWUZLA_KIND_BV_COMP: BitwuzlaKind = 11;
pub const BitwuzlaKind_BITWUZLA_KIND_BV_CONCAT: BitwuzlaKind = 12;
