/* automatically generated by rust-bindgen 0.69.4 */

use libc::FILE;

pub const BITWUZLA_SAT: BitwuzlaResult = 10;
pub const BITWUZLA_UNSAT: BitwuzlaResult = 20;
pub const BITWUZLA_UNKNOWN: BitwuzlaResult = 0;
pub type BitwuzlaResult = ::std::os::raw::c_uint;
pub const BITWUZLA_RM_RNE: BitwuzlaRoundingMode = 0;
pub const BITWUZLA_RM_RNA: BitwuzlaRoundingMode = 1;
pub const BITWUZLA_RM_RTN: BitwuzlaRoundingMode = 2;
pub const BITWUZLA_RM_RTP: BitwuzlaRoundingMode = 3;
pub const BITWUZLA_RM_RTZ: BitwuzlaRoundingMode = 4;
pub const BITWUZLA_RM_MAX: BitwuzlaRoundingMode = 5;
pub type BitwuzlaRoundingMode = ::std::os::raw::c_uint;
pub const BITWUZLA_KIND_CONSTANT: BitwuzlaKind = 0;
pub const BITWUZLA_KIND_CONST_ARRAY: BitwuzlaKind = 1;
pub const BITWUZLA_KIND_VALUE: BitwuzlaKind = 2;
pub const BITWUZLA_KIND_VARIABLE: BitwuzlaKind = 3;
pub const BITWUZLA_KIND_AND: BitwuzlaKind = 4;
pub const BITWUZLA_KIND_DISTINCT: BitwuzlaKind = 5;
pub const BITWUZLA_KIND_EQUAL: BitwuzlaKind = 6;
pub const BITWUZLA_KIND_IFF: BitwuzlaKind = 7;
pub const BITWUZLA_KIND_IMPLIES: BitwuzlaKind = 8;
pub const BITWUZLA_KIND_NOT: BitwuzlaKind = 9;
pub const BITWUZLA_KIND_OR: BitwuzlaKind = 10;
pub const BITWUZLA_KIND_XOR: BitwuzlaKind = 11;
pub const BITWUZLA_KIND_ITE: BitwuzlaKind = 12;
pub const BITWUZLA_KIND_EXISTS: BitwuzlaKind = 13;
pub const BITWUZLA_KIND_FORALL: BitwuzlaKind = 14;
pub const BITWUZLA_KIND_APPLY: BitwuzlaKind = 15;
pub const BITWUZLA_KIND_LAMBDA: BitwuzlaKind = 16;

pub const BITWUZLA_OPT_BV_SOLVER: BitwuzlaOption = 8;
pub const BITWUZLA_OPT_REWRITE_LEVEL: BitwuzlaOption = 9;
pub const BITWUZLA_OPT_SAT_SOLVER: BitwuzlaOption = 10;
pub const BITWUZLA_OPT_PROP_CONST_BITS: BitwuzlaOption = 11;
pub const BITWUZLA_OPT_PROP_INFER_INEQ_BOUNDS: BitwuzlaOption = 12;
pub const BITWUZLA_OPT_PROP_NPROPS: BitwuzlaOption = 13;
pub const BITWUZLA_OPT_PROP_NUPDATES: BitwuzlaOption = 14;
pub const BITWUZLA_OPT_PROP_OPT_LT_CONCAT_SEXT: BitwuzlaOption = 15;
pub const BITWUZLA_OPT_PROP_PATH_SEL: BitwuzlaOption = 16;
pub const BITWUZLA_OPT_PROP_PROB_RANDOM_INPUT: BitwuzlaOption = 17;
pub const BITWUZLA_OPT_PROP_PROB_USE_INV_VALUE: BitwuzlaOption = 18;
pub const BITWUZLA_OPT_PROP_SEXT: BitwuzlaOption = 19;
pub const BITWUZLA_OPT_PROP_NORMALIZE: BitwuzlaOption = 20;
pub const BITWUZLA_OPT_PREPROCESS: BitwuzlaOption = 21;
pub const BITWUZLA_OPT_PP_CONTRADICTING_ANDS: BitwuzlaOption = 22;
pub const BITWUZLA_OPT_PP_ELIM_BV_EXTRACTS: BitwuzlaOption = 23;
pub const BITWUZLA_OPT_PP_EMBEDDED_CONSTR: BitwuzlaOption = 24;
pub const BITWUZLA_OPT_PP_FLATTEN_AND: BitwuzlaOption = 25;
pub const BITWUZLA_OPT_PP_NORMALIZE: BitwuzlaOption = 26;
pub const BITWUZLA_OPT_PP_NORMALIZE_SHARE_AWARE: BitwuzlaOption = 27;
pub const BITWUZLA_OPT_PP_SKELETON_PREPROC: BitwuzlaOption = 28;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST: BitwuzlaOption = 29;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_EQ: BitwuzlaOption = 30;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_DISEQ: BitwuzlaOption = 31;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_BV_INEQ: BitwuzlaOption = 32;
pub const BITWUZLA_OPT_DBG_RW_NODE_THRESH: BitwuzlaOption = 33;
pub const BITWUZLA_OPT_DBG_PP_NODE_THRESH: BitwuzlaOption = 34;
pub const BITWUZLA_OPT_DBG_CHECK_MODEL: BitwuzlaOption = 35;
pub const BITWUZLA_OPT_DBG_CHECK_UNSAT_CORE: BitwuzlaOption = 36;
pub const BITWUZLA_OPT_NUM_OPTS: BitwuzlaOption = 37;
pub type BitwuzlaOption = ::std::os::raw::c_uint;
extern "C" {
    pub fn bitwuzla_copyright() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn bitwuzla_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn bitwuzla_git_id() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo {
    pub opt: BitwuzlaOption,
    pub shrt: *const ::std::os::raw::c_char,
    pub lng: *const ::std::os::raw::c_char,
    pub description: *const ::std::os::raw::c_char,
    pub is_numeric: bool,
    pub numeric: BitwuzlaOptionInfo_NumericValue,
    pub mode: BitwuzlaOptionInfo_ModeValue,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo_NumericValue {
    pub cur: u64,
    pub dflt: u64,
    pub min: u64,
    pub max: u64,
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo_NumericValue() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionInfo_NumericValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo_NumericValue>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo_NumericValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo_NumericValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionInfo_NumericValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_NumericValue),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dflt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_NumericValue),
            "::",
            stringify!(dflt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_NumericValue),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_NumericValue),
            "::",
            stringify!(max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionInfo_ModeValue {
    pub cur: *const ::std::os::raw::c_char,
    pub dflt: *const ::std::os::raw::c_char,
    pub num_modes: usize,
    pub modes: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo_ModeValue() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionInfo_ModeValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo_ModeValue>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo_ModeValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo_ModeValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionInfo_ModeValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_ModeValue),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dflt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_ModeValue),
            "::",
            stringify!(dflt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_modes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_ModeValue),
            "::",
            stringify!(num_modes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo_ModeValue),
            "::",
            stringify!(modes)
        )
    );
}
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo>(),
        104usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shrt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(shrt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lng) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(lng)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_numeric) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(is_numeric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numeric) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(numeric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptions {
    _unused: [u8; 0],
}
extern "C" {
    pub fn bitwuzla_options_new() -> *mut BitwuzlaOptions;
}
extern "C" {
    pub fn bitwuzla_options_delete(options: *mut BitwuzlaOptions);
}
extern "C" {
    pub fn bitwuzla_option_is_valid(
        options: *mut BitwuzlaOptions,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn bitwuzla_option_is_numeric(
        options: *mut BitwuzlaOptions,
        option: BitwuzlaOption,
    ) -> bool;
}
extern "C" {
    pub fn bitwuzla_option_is_mode(options: *mut BitwuzlaOptions, option: BitwuzlaOption) -> bool;
}
extern "C" {
    pub fn bitwuzla_set_option(options: *mut BitwuzlaOptions, option: BitwuzlaOption, val: u64);
}
extern "C" {
    pub fn bitwuzla_set_option_mode(
        options: *mut BitwuzlaOptions,
